{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"1_1LdVpJvNpD1dhGsLUBLw4spKzcVF6hg88C": [
			{
				"comment_id": 1,
				"body": "Essa é nova, impersonar kkk",
				"added": 1457375901
			},
			{
				"comment_id": 2,
				"body": "O bagulho não garante cem por cento de anonimato",
				"added": 1457375986
			},
			{
				"comment_id": 3,
				"body": "E aí, quando vamos matar o lula?",
				"added": 1457376307
			},
			{
				"comment_id": 4,
				"body": "Existe alguma pagina que seja semelhante ao youtube? em que eu posso publicar videos?",
				"added": 1457376417
			},
			{
				"comment_id": 5,
				"body": "Procuro dois homens que possuam armas, que sejam bem machos, existe um velho morando em uma pequena cidade, a casa dele não possui muros, as vezes fica só ele sozinho e a empregada, e as vezes ele e seu filho e a empregada, eu preciso de dois homens pica dura mesmo, pra ir la nessa cidade alugar uma casa para cativeiro, se tiver um dinheiro para investir em isolamento acústico seria melhor ainda, esse velho é um dos mais ricos do brasil, sequestrando ele, que é facil, daria para tirar no  mínimo 5 milhões de reais para cada um incluindo eu, eu tenho a forma de pedir o resgate, tenho contatos seguros, os dois que farão o trabalho não me conhecerão em momento algum, eu apenas coordenarei o trabalho remotamente via celular, ou internet, depois de tendo ele em mãos, fica por conta de voces, se preferirem ou não mostrar o rosto, deixar ele amarrado numa sala com isolamento acústico, ou se for uma casa isolada da cidade, talvez de certo tambem, eu tenho o caminho e a forma segura de receber o resgate, da para pedir 10 milhões de reais para cada um, total de 30 milhões. interessados devem entrar em contato aqui mesmo, que em breve, nos próximos dias estarei disponibilizando o meu email anônimo para melhor negociarmos.",
				"added": 1457640745
			},
			{
				"comment_id": 6,
				"body": "> [abu](#comment_5_17R3cGDMH7ttEac91wqHQk8o1WTaKbA4gJ): Procuro dois homens que possuam armas, que sejam bem machos, existe um velho morando em uma pequena cidade, a casa dele não possui muros, as vezes fica só ele sozinho e a empregada, e as vezes ele e seu filho e a empregada, eu preciso de dois homens pica dura mesmo, pra ir la nessa cidade alugar uma casa para cativeiro, se tiver um dinheiro para investir em isolamento acústico seria melhor ainda, esse velho é um dos mais ricos do brasil, sequestrando ele, que é facil, daria para tirar no  mínimo 5 milhões de reais para cada um incluindo eu, eu tenho a forma de pedir o resgate, tenho contatos seguros, os dois que farão o trabalho não me conhecerão em momento algum, eu apenas coordenarei o trabalho remotamente via celular, ou internet, depois de tendo ele em mãos, fica por conta de voces, se preferirem ou não mostrar o rosto, deixar ele amarrado numa sala com isolamento acústico, ou se for uma casa isolada da cidade, talvez de certo tambem, eu tenho o caminho e a forma segura de receber o resgate, da para pedir 10 milhões de reais para cada um, total de 30 milhões. interessados devem entrar em contato aqui mesmo, que em breve, nos próximos dias estarei disponibilizando o meu email anônimo para melhor negociarmos, e todo o trabalho é no Brasil.",
				"added": 1457641146
			},
			{
				"comment_id": 7,
				"body": "Preciso de alguém que empreste 4 Bitcoins, devolvo 5 Bitcoins em 3 meses.",
				"added": 1458670678
			}
		]
	},
	"comment_vote": {}
}