{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Kaffie's Blog",
			"body": "http://127.0.0.1:43110/1N6zp6jCXPBktNMPfe7UJBpQGyfCq7k2M8",
			"added": 1456870457
		},
		{
			"topic_id": 2,
			"title": "Kaffiene - Search Engine",
			"body": "http://127.0.0.1:43110/kaffiene.bit",
			"added": 1458798698
		}
	],
	"topic_vote": {
		"121_1M5ztUWkCMP5Pv7MjwApWT7CNvWimGFaFa": 1,
		"1_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"1_16Szsy1UtjiXpEevWVdUDrNfNTAZ9PLbcY": 1,
		"1_1ADB7TdX2fVbTsWBoMe9yBTmVXTbb33b4R": 1,
		"3_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS": 1,
		"1_19oqmmxwEN4mBrKAevRx5WiQKtkX8zGsbi": 1,
		"2_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"2_1F1kDrT693w8ATbcXV1wHmGSD6SpSY4f5L": 1,
		"2_1FJf2hQWT6YY9oxXozkx1ZvBHyAJVYmb76": 1
	},
	"next_comment_id": 27,
	"comment": {
		"1_1Ad65ppm6jjuP1rzFTQZRGzBHVGWk8EcyA": [
			{
				"comment_id": 1,
				"body": "> [void](#comment_2_1Ad65ppm6jjuP1rzFTQZRGzBHVGWk8EcyA): https://torrentfreak.com/play-p2p-impossible-shutdown-160301/\n\nThere's also the article posted over on the [talk site.](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:4283_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG/Play+A+P2P+Distributed+Torrent+Site+That+s+Impossible+to+Shut+Down)",
				"added": 1456862852
			},
			{
				"comment_id": 3,
				"body": "> [zerolund](#comment_1_1C65teityU6ubPZuZAdKyfgC58cgai561z): Hey, found out about this from torrentfreak, you guys did a great job on this! Do you think you'll expand this to other things besides movies? Would be pretty cool to see a similarly well-made \"zerobay\", especially if it'll have a web-based torrent client. \n> Anyway, cheers and keep up the good work!\n\nThere's already [ZeroBay.bit](http://127.0.0.1:43110/zerobay.bit) and [0Torrent](http://127.0.0.1:43110/192dZ1EG5tU7PnCfuwGMDEBrr2eLqvs4t3) (click the names to navigate to the sites). Zerobay seems to be broken though, or perhaps it's just something on my end. 0Torrent looks like a clone site of the general talk page but modified to have file uploads and categories.",
				"added": 1456871151
			},
			{
				"comment_id": 4,
				"body": "> [war59312](#comment_1_1PXHuyMr4g7zLeVr6yAgfDQJBkFsUqL1V1): Pretty cool but very buggy. Only working in IE 11 for me.\n> Chrome 50 dev says: Connection with UiServer Websocket was lost. Reconnecting...\n> Console reports: \"lib.geventwebsocket.handler Bad server protocol in headers\"\n> Tried reloading play website via context menu and I get: \"Forbidden Wrapper nonce error.\" Oddly if I refresh via F5, no such error.\n> When play page does load, no movies listed. Just see \"Popular now Most downloaded Recently added\"\n\n\n> [glock](#comment_48_1M5ztUWkCMP5Pv7MjwApWT7CNvWimGFaFa): Hmm, it works fine on linux and firefox.\n\nWorks fine on OS X/Safari for me.",
				"added": 1456905753
			}
		],
		"1_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": [
			{
				"comment_id": 2,
				"body": "Nothing special. Just wanted to link my blog for anyone who might be interested.",
				"added": 1456870481
			}
		],
		"1_1HSBkju9y9tQrpph3yKgcdzxM6pnkvgmNy": [
			{
				"comment_id": 5,
				"body": "> [juanje](#comment_1_1HSBkju9y9tQrpph3yKgcdzxM6pnkvgmNy): I don't know why it doesn't show the title...\n\nClick and drag the top right icon to the left. Scroll down and there'll be a section called \"Site Title\". Set it to what you want and hit 'save changes'. Then sign/publish.",
				"added": 1457000747
			}
		],
		"1_16Szsy1UtjiXpEevWVdUDrNfNTAZ9PLbcY": [
			{
				"comment_id": 6,
				"body": "Neat, but it seems to be broken... Won't let me post anything.",
				"added": 1457076362
			},
			{
				"comment_id": 8,
				"body": "> [nullpo](#comment_2_16Szsy1UtjiXpEevWVdUDrNfNTAZ9PLbcY): Added recent pastes listhttp://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?recent\n\nNice. Keep up the good work. Is there a way to delete pastes yet?",
				"added": 1457096925
			}
		],
		"1_14sTmqjJL5vLzTuN7JiNunUPcX2i2ctYsF": [
			{
				"comment_id": 7,
				"body": "> [bowl](#comment_1_1PmQPsmpcuDvtjKQ6J9g2bH39w1TKAwGPr): why are you posting google links?\n\nThe better question is: why do people post links that lead outside of 0net? This is clearly a forum for posting 0net links.",
				"added": 1457084384
			}
		],
		"1_19z3VucxwAoyQZwhmjEgA6vJ9TTp2GmGLN": [
			{
				"comment_id": 9,
				"body": "> [pycole](#comment_9_1KwTTgPRSTHFmmJAFBt6kQfdyNeSM5KJuH): Neat. if you want to access zerosearch's list of sites, you can find it in data/1ZeroeuDnL2jNS6t1epQa1SPvC91KG8ER/data.dat (not sure if you already did or not.) Only complaint so far: hitting enter doesn't trigger a search. Just a bit of an annoyance, that's all.\n\nJust an FYI, if you're going to clone site indexes, go ahead and clone Kaffeine's. It's the same format as ZeroSearch's, but I take the time to clean out any duplicates. As of now, the '308' sites listed on bwoi and the '300' sites listed on ZeroSearch are closer to around 250, due to the number of duplicate sites.\n\nHaving the highest number of indexed sites doesn't mean much if they're all the same site :\\",
				"added": 1457136027
			},
			{
				"comment_id": 10,
				"body": "> [ass](#comment_4_19z3VucxwAoyQZwhmjEgA6vJ9TTp2GmGLN): I'll look through the index today, in hopes of finding all the duplicates and removing them - thanks for telling me! :)\n\nIf you need a tool to detect duplicates, I've provided one [here](http://127.0.0.1:43110/search.kaffie.bit/check.py). It only checks the address, rather than domain names. But I tried it on the names.json at the root of your site and it picked up quite a few. Might help you clean out the list.",
				"added": 1457165347
			},
			{
				"comment_id": 11,
				"body": "> [ass](#comment_6_19z3VucxwAoyQZwhmjEgA6vJ9TTp2GmGLN): I don't think your tool's working properly.  It's listing bwoi.bit as being a duplicate when I've made sure that it's only there once?\n\nIt doesn't really work properly with .bit domains, so it might be struggling there. For reference, I ran it on the names.json file at the root of bwoi.bit and it gave me: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_2\n\nI don't see the bwoi address 1f7FYxZWSZ5YG7Nd8sGsHcWEQgvdnVvQF in there at all. Could you paste the output in a NullPaste so I can see what it's doing? It should work properly. All it's doing is grabbing the list of addresses using regex, and then turning it into a set to remove duplicates (built in python function) and then comparing the two lists. If there's a duplicate listed, it's almost certainly a duplicate.",
				"added": 1457169885
			},
			{
				"comment_id": 12,
				"body": "Just an FYI, you have two duplicate sites now. Not one :P. I've updated the 'why' page to detail it a bit more. Just trying to keep everyone honest. Bwoi's neat. And it definitely has potential. I just hate to see it spoiled on petty one-ups of faulty numbers.\n\nBut at least you're making an effort, rather than like ZeroSearch, which still has many duplicate sites, has not correctly reported site count, has copied features of Kaffiene, etc.\n\nI'm providing the tools and information to make ZeroNet search the best it can be. Please don't take that the wrong way. I have no control over bwoi, and it's best to inform users what's up. To see an index have '308' sites when it really has ~260 is misleading. Bwoi has 280 sites. Not 300. Not 282. Not 281.",
				"added": 1457177183
			},
			{
				"comment_id": 14,
				"body": "> [ass](#comment_8_19z3VucxwAoyQZwhmjEgA6vJ9TTp2GmGLN): Just saying, I copied ZeroSearch's indexes and then added some sites from yours to make sure I was 'up to date'.  It's fine if you don't want me using stuff from your site so I've taken the liberty to use an old backup.  I've also now updated my names.json and have no duplicates as far as I know.  I think that the one exception your tool didn't find was actually from ZeroSearch, so I've also removed it there too.  I don't want to be against you at all, and I know you're trying to help.  I'm also rounding my numbers now, to make things a little nicer. I've also added a little link to Kaffiene in case it has results that Bwoi doesn't.\n\nThe issue isn't copying my index of sites. You can freely take that. The issue is misleading results due to duplicate and 'bad' entries. Hopefully this all didn't come across in the wrong way. Bwoi was mostly just caught in the crossfire. The main reason I put up the 'why' page was ZeroSearch. Bwoi appeared to have copied the results as well, but I see now it's mostly because you copied ZeroSearch who copied Kaffiene.\n\nWhen I first ran across Bwoi, I was a bit skeptical, since it boasted a huge number of sites. It seems that it was mostly a merging issue, and that's been taken care of. There was still some issues with duplicate entries, so I pointed those out. And the resulting list more or less resulted in ZeroSearch's list combined with a few new entries of mine, which then resulted in more or less my list. Amusingly this is due to me having a lot (~130) of ZeroSearch's entries due to cloning, and then ZeroSearch taking Kaffiene's index in a rush and not caring to fix issues. I have no doubt that it's mostly due to the sloppy work of ZeroSearch at this point. But Bwoi *did* mirror Kaffiene's results (even now there's many links that are word-for-word the same entries as Kaffiene), and *did* have duplicate results.\n\nI'm fine with the other sites sharing the index. I just find it dishonest to try and then use that, along with duplicate entries to try and boast the largest site count. The 'why' page was originally meant to clarify this, and explain that it's not the fault of Kaffiene for lacking, but for the other sites having duplicates.\n\nAnd so, for the time being, I've cleared Bwoi from the page besides an update that clarifies this, and am leaving it up until ZeroSearch removes it's duplicate entries or Kaffiene surpasses ZeroSearch in site count (despite ZS's duplicates). If you'd like me to remove any mention of Bwoi, that's fine too.",
				"added": 1457183615
			},
			{
				"comment_id": 15,
				"body": "> [bwoi](#comment_1_1F1kDrT693w8ATbcXV1wHmGSD6SpSY4f5L): (I'm Bwoi now!)I don't think anything really did come across in a bad way as I can totally understand you protecting your site and trying to make it better - and I respect that.  I'll try and see if there are any more duplications and try and \"differentiate\" my site from yours - there's not really much point in reinventing the wheel.  ZeroSearch is pretty much dead at this point - probably due to the fact that it's just a clone of Kaffiene.\n\nYea, it was mostly just frustration. It's frustrating when you see a site has 'more' sites listed due to duplicates, so you go through and get 60+ more links and they're just copied the next day. Unwinnable. There'd always be those 25 extra links, and they'd always copy the new ones. It's easier to address the issue than to partake in a race I'd surely lose.\n\nAs for Bwoi, I *really* like the UI. I've said that before, and it's still true. It's very google-esque, and I could see you doing great things with it. The initial pull you had with just .bit domains was interesting, since it provided something unique. Now there's not much to it besides a nicer UI (Kaffiene's sucks, lol). But I'm interested to see where you'll take it.",
				"added": 1457184517
			}
		],
		"1_1ADB7TdX2fVbTsWBoMe9yBTmVXTbb33b4R": [
			{
				"comment_id": 13,
				"body": "Nice Meme! :D",
				"added": 1457177896
			}
		],
		"2_1MaXyfVAZyyRfY2n8G81sVwRuUZhnzDLX": [
			{
				"comment_id": 16,
				"body": "There's more than that: http://127.0.0.1:43110/search.kaffie.bit/?q=%5Br%5D%20search%20engine\n\nQuite a few search engines, actually.",
				"added": 1457578868
			}
		],
		"62_1M5ztUWkCMP5Pv7MjwApWT7CNvWimGFaFa": [
			{
				"comment_id": 17,
				"body": "> [teste](#comment_3_1G8pVte4K31ssceSN3AA4EfiT6zyKq7RXf): Not Found!\n\nWorks on the proxy: http://bit.no.com:43110/13NS3rSzCTpAYtH997rphfZDaWRypyjwnU",
				"added": 1457617681
			}
		],
		"1_17NERw5U2VKVnDW1iJ2pHWbtBKmmptLB44": [
			{
				"comment_id": 18,
				"body": "http://127.0.0.1:43110/search.kaffie.bit/",
				"added": 1457926972
			}
		],
		"1_1JEmH2pfXkpMMdzsJ256jzq2GTSxEacS2B": [
			{
				"comment_id": 19,
				"body": "> [b3nis](#comment_1_1HwYER58xAxchBDL6WKRqKuPZzmwSvMwjY): DON'T CLICK THESE LINKS AS THEY CONTAIN CHILD PORN GUYS!!!totally not a pedo index in disguise.\n\nDoing a reverse lookup of the addresses (using Kaffiene), it shows some of them are links to 0chan. 0chan has CP on it? That's a fairly popular zeronet site. Seems like a pretty big problem, tbh. Though, when I was just browsing 0chan, I didn't see such content.",
				"added": 1458088983
			}
		],
		"2_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": [
			{
				"comment_id": 20,
				"body": "As per request, here's the official 0list entry for Kaffiene. I finally got Kaffiene.bit registered, so now you can access the site through there.\n\nFor the record, here's the official Kaffiene addresses:\n\nhttp://127.0.0.1:43110/kaffiene.bit  \nhttp://127.0.0.1:43110/search.kaffie.bit  \nhttp://127.0.0.1:43110/1Mr5rX9TauvaGReB4RjCaE6D37FJQaY5Ba",
				"added": 1458798792
			}
		],
		"1_17FByntd2WbfAjJjfEJiNuDgGJPMD3ZoDN": [
			{
				"comment_id": 21,
				"body": "Uses a DB/Search hosted on clearnet. Searches files in the same manner as Zearch (albeit to a much better degree). Has a nifty backlink search feature. The DB is apparently over 400MB. And due to that and it's centralized nature, is *not* ZeroNet friendly. Could definitely be useful in some cases though.",
				"added": 1459853877
			}
		],
		"2_1ystYHqtyYUMeRyG378bgM448sCpzZ9Xw": [
			{
				"comment_id": 22,
				"body": "Works great in Firefox, had some issues with Safari (only got one video to load). Neat tech. Now all we need is user uploads and a server to guarantee at least 1 seeder.",
				"added": 1459909687
			}
		],
		"2_1F1kDrT693w8ATbcXV1wHmGSD6SpSY4f5L": [
			{
				"comment_id": 23,
				"body": "I didn't notice any differences between Firefox and Chrome, besides that firefox seemed to glitch when the UI shifts and messes up the input a bit. Either way, I'm liking the UI. Reminds me a lot of bing.\n\n> Indexes should be updated tonight when I push the auto-updater to my VPS :)\n\nI'm curious what you mean by 'auto-updater'... Are you actually crawling sites for tags/info? Simply grabbing new sites from the various lists/dbs and uploading without tags? Keep up the good work. I came back to ZeroNet after a 3 month hiatus and found all of the other search engines were dead >_<. Glad to see Bwoi is still on-going.",
				"added": 1470312771
			}
		],
		"2_12Uapn8usaZGRVFjJ4ooJS7q4o6M5gJksN": [
			{
				"comment_id": 24,
				"body": "Because we really need a link to google.",
				"added": 1471567403
			}
		],
		"2_1HUrhTUZFB2KKsXLUv1vugPH358iB6zsiY": [
			{
				"comment_id": 25,
				"body": "\"no peers found\"",
				"added": 1472189477
			},
			{
				"comment_id": 26,
				"body": "> [19](#comment_4_1HUrhTUZFB2KKsXLUv1vugPH358iB6zsiY): Try now.\n\nindex.html not found. Please ensure that your site works on a proxy like https://proxy1.zn.kindlyfire.me/",
				"added": 1472251685
			}
		]
	},
	"comment_vote": {
		"2_16Szsy1UtjiXpEevWVdUDrNfNTAZ9PLbcY": 1,
		"8_19z3VucxwAoyQZwhmjEgA6vJ9TTp2GmGLN": 1,
		"1_1F1kDrT693w8ATbcXV1wHmGSD6SpSY4f5L": 1,
		"3_1F1kDrT693w8ATbcXV1wHmGSD6SpSY4f5L": 1,
		"6_16Szsy1UtjiXpEevWVdUDrNfNTAZ9PLbcY": 1,
		"24_16bxMyoL49mWYhcZKBYVBT5zEFW9SQpiao": 1,
		"27_16bxMyoL49mWYhcZKBYVBT5zEFW9SQpiao": 1,
		"19_16bxMyoL49mWYhcZKBYVBT5zEFW9SQpiao": 1,
		"11_1F1kDrT693w8ATbcXV1wHmGSD6SpSY4f5L": 1,
		"8_1HUrhTUZFB2KKsXLUv1vugPH358iB6zsiY": 1
	}
}