{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"2_193GRQHrQgpudYtUXtPkUp7z6DdYWkLfJX": 1,
		"120_1M5ztUWkCMP5Pv7MjwApWT7CNvWimGFaFa": 1
	},
	"next_comment_id": 8,
	"comment": {
		"2_193GRQHrQgpudYtUXtPkUp7z6DdYWkLfJX": [
			{
				"comment_id": 1,
				"body": "aqui.",
				"added": 1456988623
			},
			{
				"comment_id": 2,
				"body": "pues hay varias personas de habla hispana que quieren empezar a subir contenido en español. De momento se ve que solo son buenas intenciones.\nPor ahi encontre un blog (http://127.0.0.1:43110/19KdvvYVFWuNPHQ2t8KVPtyS4jDUn19QKo) donde recomiendan tener dos sitios, uno para contenidos y otro para el sitio en si. Digo, por si se arma algo",
				"added": 1456988824
			},
			{
				"comment_id": 3,
				"body": "ya tienen sus inboxes? yo ya habia publicado correo pero se me habia fijado que hay que crear el inbox aparte. \nahorita estoy teniendo algunos problemillas con Python, pero en cuanto los resuelva, voy a estar listo para darle por aca.",
				"added": 1456989139
			},
			{
				"comment_id": 4,
				"body": "> [zeroblue](#comment_16_193GRQHrQgpudYtUXtPkUp7z6DdYWkLfJX): Pues acabo de entrar a la red, no se nada aun. jajaja\n\nProgramas en algun lenguaje? Por cierto ya acabo de arreglar mi problema y te mande un correo. Para probar y ver como funciona esto.",
				"added": 1456989326
			},
			{
				"comment_id": 5,
				"body": "Si, python lo manejo, js muy poco y PHP lo conozco pero la neta prefiero no hacerle. \nAl parecer el desarrollo para ZeroNet se hace con js, así que en teoria podriamos hacer algo.",
				"added": 1456989640
			},
			{
				"comment_id": 6,
				"body": "mmm, al parecer tu correo aun no ha llegado... voy a esperar a ver que pasa.",
				"added": 1456989822
			},
			{
				"comment_id": 7,
				"body": "Estaria bien empezar con un blog, tambien ya hay imageboard con el que se puede empezar. Seria nada mas cuestion de montarlo (https://github.com/Nullchan/nullchan)",
				"added": 1456990167
			}
		]
	},
	"comment_vote": {}
}