{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "ZeroPolls",
			"body": "http://127.0.0.1:43110/ZeroPolls.bit",
			"added": 1457388430
		}
	],
	"topic_vote": {
		"3_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS": 1
	},
	"next_comment_id": 6,
	"comment": {
		"1_12qRBHbFje4Bn4fqoJjZUUevH5aFyWZrmW": [
			{
				"comment_id": 1,
				"body": "Old and fake, just someone trolling people, don't worry.",
				"added": 1456956837
			}
		],
		"1_1Mk5sVKeCrwMc3wSD11jM7DZTiqF5D9BaD": [
			{
				"comment_id": 2,
				"body": "Thanks! :) Changed the URL to the new ZeroPolls.bit domain, makes for shorter links when linking to a poll directly.",
				"added": 1457438178
			},
			{
				"comment_id": 3,
				"body": "> [basxto](#comment_15_1PVcdu7USZH2kHMETbqDYLPjJZKCDWM52k): Showing results without voting would be also an interesting feature.\n\n> [odd](#comment_5_1EMpuiFM1NLZmAVyoAWnwi8VwiZVV4dcnN): That can bias the vote though which is why most poll sites don't do it.\n\nYeah that's why i haven't done it yet. Would be easy to add a checkbox to the UI that when toggled shows all polls with results. On some polls I didn't want to vote but did want to see the results, so this would be useful to me too, but then it could influence the vote and forcing people to vote to see results also forces them to participate in the site which makes it more fun for everyone :) Could add a results button to each poll that shows you the results but also means you can't vote anymore, that would take care of the influencing the vote issue. So yeah I'm not sure yet if I'll add that, but I am thinking about it.\n\n> [vermilllion](#comment_2_16k9pNCerEdsZvWU82HMesThKFo9fofRfz): THIS FUCKING RUSSIAN SPAMMER REEEEEEEEEEEEEEEEEEEEE.\n> YOU EVEN FUCKED UP ZEROCHAN\n\nLOL, have to say when I saw a poll with that weird text, I laughed. I had seen these messages spammed on ZeroTalk before, was just really funny to see it as a poll suddenly.",
				"added": 1457495874
			},
			{
				"comment_id": 5,
				"body": "> [basxto](#comment_19_1PVcdu7USZH2kHMETbqDYLPjJZKCDWM52k): Maybe (anonymous) comments would be a nice extra. Sometimes you just feel like a question is too squishy or that an answer misses some important additional point\n\nComments are planned for the next bigger update, maybe this weekend if I find the time, but not anonymous, the comments are like the votes tied to the ZeroID you are logged in with. But there are multiple people working on ZeroID services in addition to ZeroID.bit now, so you will at some point be able to select one additional ID provider to use for ZeroPolls, then you can use one ZeroID as an anonymous throwaway account separate from your main identity. People would in effect be able to vote twice if they logged in with both their ZeroIDs one after another, but not more than that, so nobody can really rig the vote by voting a hundred times or something like that.",
				"added": 1457721775
			}
		],
		"4_1JA2umSc9f7VSNLaYLs1Cpk7rpvS4p18xe": [
			{
				"comment_id": 4,
				"body": "> [pycole](#comment_23_1KwTTgPRSTHFmmJAFBt6kQfdyNeSM5KJuH): Well, the whole thing downloads for me. Guest we can at least handle files up to 28mb. Cool.Torrent-like transfers will make this a whole lot easier, though that feature seems to be further down the road.\n> Hmm...Anyone good with DHT?\n\nIt depends on the speed of your internet connection, not the size of the file. The limit here is a timeout for downloads ZeroNet has set. If downloading a file takes longer than that timeout, the download is canceled. I don't remember the exact number, nofish posted it on ZeroTalk a while ago, I want to say it was 15 seconds and he said he will raise it a bit.",
				"added": 1457527884
			}
		]
	},
	"comment_vote": {
		"3_1EMpuiFM1NLZmAVyoAWnwi8VwiZVV4dcnN": 1,
		"1_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx": 1
	}
}