{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"2_193GRQHrQgpudYtUXtPkUp7z6DdYWkLfJX": [
			{
				"comment_id": 1,
				"body": "> [zelounge](#comment_1_1P1nCH4fZ3VkzgPtpWyufktimJWcSwbZkw): Primero, me parece mas y mas imprecedinbles de saber leer y hablar ingles (para que sepas, soy francofono). La quantidad de informaciones de todo tipo es tan mas en ingles que en cualquier idioma. Seguro que te has dedo cuenta.\n> Segundo, tu pregunta, amenudo las pelis incluyen los subtitulos en ingles, especialmente las de tipo mkv (a veces las otras tambien).  En Play-ZeroNet, de lo que he visto, la majoria provienen de RARBG... cuando cliqueas una funda(imagen), se abrira una ventana con los detalles... en esta, en la esquina baja-derecha tiene la fuente (source) y puede cliquear sobre ella y te llegaras a la pagina de rarbg. Alli encontraras varias versiones de la peli. Elijes con cliquear para tener los detalles, y alli encontraras \"[+] Show MediaInfo\" donde podras ver las pistas que hay (video, audio, texto...) y cual es el idioma relacionado.\n> So no encuentras una version de la peli que quieres con subtitulos, la ultima opcion es de buscar en google o otro, por el nombre de la pelicula + subtitles + spanish (probas con las palabras español, a ver si hay mas resultados).Si encuentras, veras que puede tener mas de una version en español... hay que encontrar la que corresponde a la version que has descargado (rarbg, evo, etrg)\n> Bueno, espero que mi corta explicacion contesta un poco a tu pregunta.Suerte, desde Montreal. :)\n\nHola!!! Puedes bajar los subtitulos desde subdivx.com !!!\nCuidate!",
				"added": 1458091458
			},
			{
				"comment_id": 2,
				"body": "> [dcapeletti](#comment_2_1FGs1Gjnx5nQnfR8X1jXdS1fUyy46iWht4): ¿Las películas de play están todas en Ingles? ¿Cómo consigo subtituladas o en español?Play http://127.0.0.1:43110/1PLAYgDQboKojowD3kwdb3CtWmWaokXvfp/\n\nsubdivx.com ! ahi encuentras todos los subtitulos que necesites.",
				"added": 1458091518
			},
			{
				"comment_id": 3,
				"body": "> [yarper64](#comment_1_152X4bdgC92XVk7TnaJu9FYDR8HimRFuJQ): Oigan, tanto que joden con el libro este de la luna de plutón y no lo he logrado conseguir ¿alguien tiene algun enlace para descargarlo?\n\nCual libro? de que trata?",
				"added": 1458091549
			}
		]
	},
	"comment_vote": {}
}