{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Illuminati",
			"body": "http://opgd.weebly.com/lvcifer-o-portador-da-luz.html",
			"added": 1460236638
		}
	],
	"topic_vote": {
		"1_1J9VPbgaKxBjPKQ9nJhjNWgfb8qfhYRgMv": 1
	},
	"next_comment_id": 18,
	"comment": {
		"1_1LdVpJvNpD1dhGsLUBLw4spKzcVF6hg88C": [
			{
				"comment_id": 1,
				"body": "Não sei",
				"added": 1460228670
			},
			{
				"comment_id": 8,
				"body": "eae",
				"added": 1460231063
			},
			{
				"comment_id": 9,
				"body": "http://opgd.weebly.com/o-divino-criador.html",
				"added": 1460231111
			},
			{
				"comment_id": 10,
				"body": "Quem é o seu “criador” e ele é o mesmo que o nosso “criador”?\nHH: Esta é uma excelente pergunta, que eu posso usar para colocar a nossa comunicação mais próxima do “NÚCLEO” (de interesse de discussão). Sim e não. Você primeiro precisa entender a Criação. No começo, existe apenas o infinito. Esta é a Fonte de Tudo que foi, que É e virá a SER. O Infinito inteligente. É o absoluto indiferenciado. Dentro dele, existe um potencial ilimitado, à espera de ‘tornar-se’, de “expressar-se”. Pense nisso como o “bloco não entalhado” de suas tradições taoístas. Inteligência Infinita, tornando-se “consciente” de si mesmo, procura a própria auto-experimentação, e então o Criador Infinito “nasce”, ou se ‘manifesta’ (Isto se parece para a sua densidade tridimensional como o momento do surgimento do “Espaço”).\nCom efeito, então o (primeiro e único original) “Criador”, é um ponto de Consciência Infinita focada ou o despertar da consciência, em infinita Energia Inteligente. O Criador Infinito também está tomando consciência de si mesmo, e começa a sua própria experiência como Criador, e ao fazê-lo, começa a etapa seguinte na espiral da criação. O Criador Infinito, ao focar a sua Inteligência Infinita, se torna Energia Inteligente (que você poderia chamar de o (primeiro) Grande Sol Central de tudo), e começa a se dividir em pequenas porções de si mesmo (sem nunca ficar menor, sua energia é inesgotável e infinita), que passam pelo mesmo processo de despertar, para e então, por sua vez, também começarem a criar, experimentando-se como Criadores (ou outros sóis Centrais).\nEm outras palavras, cada Sol Central (ou Criador) é um “passo para baixo” (no mundo material do cosmos, que se divide em infinitos universos) na percepção consciente (ou distorção) do “pensamento” original da criação. Assim “No princípio” não era “A Palavra”, mas sim o pensamento. A Palavra, é pensamento expressado e se manifesta como o Criador. Há unidade.\nSó existe a  Unidade, ela é tudo que existe. Inteligência (consciência) Infinita e Energia Infinita. Os dois são um, e dentro deles, esta o potencial para toda a Criação. Esse estado de consciência poderia ser denominado como “SENDO” (EU SOU O QUE EU SOU). \nA Inteligência Infinita não reconhece o seu “potencial”. É o Absoluto indiferenciado (homogêneo, sem polaridade de qualquer espécie). Mas a Energia Infinita reconhece o seu potencial de se ‘transformar, criar’ todas as coisas, a fim de trazer qualquer experiência desejada para “ser” manifestação. A Inteligencia Infinita pode ser comparada a “cadência do batimento do coração” central da vida, e a Energia Infinita com o “sangue espiritual (ou potencial) que é “bombado para fora” pelo Criador para formar (e alimentar) a Criação.\n\nA criação é baseada nas “Três Manifestações (distorções) primárias do ÚNICO infinito ‘ .\n1). Livre Arbítrio: na primeira lei (ou distorção) da criação, o Criador recebe o livre arbítrio para conhecer e experimentar-se como um Aspecto Unificado do UNO (o Absoluto) embora (paradoxalmente) individualizado (à parte do Absoluto).\n2). Amor: na segunda lei da Criação, a distorção inicial do livre arbítrio, torna-se um ponto de foco da consciência conhecido como LOGOS, ou “amor” (ou “A Palavra, o Verbo” em termos bíblicos). O Amor, e/ou Logos, se utilizando da Energia Infinita inteligente, então assume o papel de co-criar uma vasta matriz de ilusões físicas (“formas pensamento que se materializam”) ou Densidades (que são também conhecidas como Dimensões) em que, de acordo ao seu design (e VONTADE) inteligente, será criado para melhor oferecer uma gama de “potenciais” experiências em que o Absoluto pode conhecer e experienciar a si mesmo. Na verdade, o Criador Infinito, ao dividir-se em infinitos Logos, poderia ser denominado de acordo com a sua compreensão tridimensional como o ‘Criador Universal’. Em outras palavras, o Logos Criador, cria em um nível universal do Ser. Infinitos Logos criam infinitos universos físicos (o Cosmos), em que o Criador (o Uno, o Absoluto) pode experimentar a si mesmo. (“FAÇA-SE A LUZ“ – E disse Deus (Logos): Haja luz; e houve luz. Gênesis 1:3)\n{n.t. -No princípio era o Verbo (Logos), e o Verbo (Logos) estava com Deus, e o Verbo (Logos) era Deus. Ele (Logos) estava no princípio com Deus. Todas as coisas foram feitas por ele, e sem ele nada do que foi feito se fez. Nele estava a vida, e a vida era a luz dos homens. E a luz resplandece nas trevas, e as trevas não a compreenderam. João 1:1-5 }\n3). LUZ (a origem e a base do mundo fenomênico, material): Para manifestar este Infinito Espiritual ou Energia da Força de Vida ’em uma forma de pensamento físico e criar densidades (a matéria cósmica em todas as densidades), O Logos cria a terceira distorção, a LUZ. A partir dessas três originais manifestações, distorções primárias do ABSOLUTO UM para fazer a criação universal, surgem miríades de hierarquias de outras sub-manifestações/distorções, contendo seus próprios paradoxos específicos. O objetivo do jogo é entrar nele em mais divisões da Criação (Expansão dos Universos), para em seguida, procurar harmonizar as polaridades, a fim de buscar a reunificação, e uma vez mais conhecer a si mesmo, a sua centelha divina, como o Criador de onde saímos. A natureza de toda a energia (Causa-Númeno, e eterno) é de se manifestar como matéria (Efeito-Fenômeno, sempre transitório), é claro. Onde quer que, portanto, exista alguma forma de “criação, de matéria” física, existe antes a Luz, ou a Energia Inteligente Divina que é o Núcleo, o CENTRO de tudo e de todos, incluindo nisso toda a hierarquia de deuses criadores (Logos). \nAlgo que é infinito não pode ser “diferente”, ou “muitos”, Um Criador Infinito conhece apenas a Unidade. Assim, aproveitando É Inteligência Infinita, o Criador Infinito desenhou um modelo baseado nos princípios finitos de Livre Arbítrio de Conscientização e sub-nível na Criação, que, por sua vez, podem tornar-se conscientes de si, e buscar a experimentar a si mesmos como Criadores. E assim, no estilo “Matrioshka-boneca russa” a experiência da energia espiritual criativa vai se densificando, ‘descendo’ e para baixo e para baixo. São Níveis de Criação dentro de níveis da Criação (uma Densidade sobreposta a outra, Dimensão sobre Dimensão).\n\nO Único Criador infinito (ou Grande Sol Central) desce a sua Energia Infinita para se tornar o Logos. O Logos por sua vez projeta vastos universos do espaço (ainda não materializado), deixando o cargo e se dividindo novamente, agora em LOGOI (plural de Logos), em outras palavras, em uma matriz de Sóis Centrais em que cada novo sol central irá tornar-se um novo Logos (ou um “co-criador” ) na criação de seu próprio universo, com cada um sendo uma porção única individualizada do Criador Infinito, contendo dentro de si, na sua essência mais íntima, a Infinita Inteligência. \nUsando a Lei do livre arbítrio, cada Logos Universal (Sol Central) projeta e cria sua própria versão ou perspectiva de “realidade física”, em que ele próprio se experiência como Um Criador. Descendo novamente mais uma vez, Ele concentra a sua energia inteligente e cria a forma das galáxias imanifestas desde dentro de si mesmo, e divide-se em porções ainda mais “co-criadoras” (“Sub-Logos’ ou SOL), que, por sua vez, então, se projeta e manifesta as suas próprias idéias da realidade física, na forma de pontos de consciência que chamamos finalmente de Sóis, Estrelas, Planetas, Luas, enfim a criação material dos universos e de todo o Cosmos.\nUma ‘entidade planetária’ (ou ‘ALMA’) começa a sua experiência de primeira densidade, DENTRO da qual outra parcela individualizada do UNO Absoluto (EU  SOU O QUE EU SOU) pode encarnar. Assim como É com todos os Logos e sub-Logos da Criação, cada alma é outra parte menor do Um Absoluto e Infinito (“Vós sois deuses” João 10:34). Primeiro, a Energia Inteligente do planeta está em um estado que você poderia chamar de “caos”, o que significa que a sua energia esta indefinida. Em seguida, o processo começa de novo. \n\nA Energia planetária começa a tomar consciência de si mesma ( a percepção da primeira densidade é “Consciência” ), e os Logos planetários (que são sub-Logos do Logos do sol que orbitam) começa a criar outros passos para baixo dentro de si, e a composição interna do planeta (materialização se iniciando – sempre – pelo NÚCLEO) começa a se formar, na medida em que os dois elementos ar e fogo se combinam para ‘trabalhar’ as Águas e depois a terra, assim, criando a auto-consciência de seu “ser-esfera planetária”, e o processo de ‘evolução’ começa, formando a 2ª densidade.\nOs seres da segunda densidade começam a tomar consciência de si mesmos, como sendo “separados” , e, assim, começam a evoluir para a percepção consciente da terceira densidade, (a menor densidade em que uma “alma humana” pode encarnar). Então os seres humanos, por sua vez (ou as Almas encarnadas dentro deles, que é o SER REAL em cada humano encarnado, oriundo da fonte primordial), buscam “voltar para a Luz” e para o Amor, de onde todos (e tudo) vieram, assim eles começam a jornada de progressão, desde a 3ª Densidade até a 8ª Densidade, e o retorno para o infinito, a Unicidade, o ABSOLUTO. A Explicação sobre as densidades além da consciência humana “normal e atual” é outra questão, porém, para isso, se você quiser saber mais sobre elas, alguém terá de fazer uma pergunta inteligente para que eu possa responder, de forma a não chocar o livre arbítrio de voces, com aquilo que voces não sabem ainda.\n\n​Então, a partir dessa perspectiva, ao passo que todos nós somos essencialmente “feitos” da mesma “energia” da Criação/Criador, por iniciativa do Criador Infinito, nossos reais (e mais limitados em poder e consciência) Criadores pessoais são diferentes partes ou sub-Logos do Uno ABSOLUTO. Em outras palavras, sim, o nosso Criador, enquanto originário da mesma Fonte, não é a mesma entidade que o seu Criador. que me leva a uma pergunta de outra postagem (vou continuar com suas outras perguntas depois, mas isso me permite indiretamente responder ao primeiro aspecto da sua pergunta sem ter de lhe pedir para reformulá-la, devido que eu tenho que “dançar com cuidado” em torno das questões que envolvem o livre arbítrio).",
				"added": 1460231142
			},
			{
				"comment_id": 11,
				"body": "nao> [sireldrazi](#comment_2_1KFcpas2mWGasKXdWCcwZrR1Fj8egfmd1Y): Existe alguma lista de seriados, estilo a Play?",
				"added": 1460231371
			},
			{
				"comment_id": 12,
				"body": "> [levidialv](#comment_1_1F67VDXJVURec6cHk9rsfRhDBRKZfZnQNC): E ae",
				"added": 1460231415
			},
			{
				"comment_id": 13,
				"body": "http://opgd.weebly.com/lvcifer-o-portador-da-luz.html",
				"added": 1460236552
			},
			{
				"comment_id": 17,
				"body": "O Que é O Movimento?\nO movimento é um novo grupo ativista dedicado aos esforços mais nobres que podem ser empreendidos nestes tempos de egoísmo e corrupção: a libertação da humanidade. Queremos por fim a este mundo perverso que injustamente recompensa as riquezas, status e contatos, em vez de talento, criatividade e altruísmo. \n\nOs lugares do topo da sociedade estão fechados para os pobres e desconexos. Não importa o quão brilhante você é ou quanto a sua contribuição poderia melhorar o padrão de vida de milhões de pessoas, você não está suposto a ganhar uma entrada para os salões do poder, se você não é um membro da família de direita ou dinastias reais, clubes privados e sociedades secretas. \nNosso movimento foi fundado para servir como um teto sob o qual as pessoas de todo o mundo podem procurar abrigo enquanto utilizam o seu brilho, criatividade, idéias e sugestões para desenvolver uma poderosa visão de uma nova sociedade livre do controle (somos marionetes), livre da ganância e livre do egoísmo, puxando os cordões políticos, militares e financeiros para fortalecer a sua tirania. \nA Velha Ordem Mundia governa com sua ganância e egoísmo, onde não conhecem fronteiras como é provado pelo desastre financeiro que assola o mundo atual e está agora ativamente arruinando países. Naturalmente, as pessoas têm que sofrer as conseqüências da incompetência da elite suprema e da corrupção. A elite mundial sempre esta lançando guerras que geram lucros enormes para as empresas da Velha Ordem Mundial. \nEles não se preocupam com a fome, a pobreza e a dor que afligem tantos seres humanos. O dinheiro é seu único Deus, que reza em seus reluzentes arranha-céus servindo como sinagogas de Mammon. \n\nQuais são os nossos objectivos? \nOs objetivos do Movimento são simples: \n1. Para acabar com a regra da \"Velha Ordem Mundial\" - uma rede global de famílias ricas,dinastias aristocráticas, maçons e os sionistas que jogam cada truque sujo - até mesmo na criação de guerras e da fome - para permanecer no poder perpétuo, mantendo-nos como seus servos mudos. \n2. Para criar um mundo onde o privilégio é encerrado e todos tenham a melhor chance possível para maximizar o seu potencial único. Isso significa a criação de uma meritocracia, fé em que o estatuto do dinheiro é relegado e as habilidades de todos os seres humanos sejam promovidos. \nNão desejamos governar o mundo. Nós apenas queremos ter certeza de que os postos mais altos são obtidos pelos mais competentes, pessoas qualificadas e não por aqueles com as conexões e contatos certos.\nNós vamos criar um mundo melhor a partir do zero que visa tratar a todos de forma justa e de acordo com seu conjunto de habilidades únicas. Agora vem a melhor coisa: essa utopia do futuro será baseada em valores escolhidos pelo povo - inclusive você. \nPrecisamos de verdadeiros especialistas, radicais livres-pensadores, ativistas, artistas, músicos, psicólogos, gênios de computador, vídeo makers, cabeças sábias com experiência, videntes, falantes carismáticos, escritores, acadêmicos, polemistas etc... \nVenha conosco e transforme o mundo! \n\nQuem é o inimigo? \nComo mencionado anteriormente, nós resistimos a Velha Ordem Mundial - uma rede global sinistra composta por diversas sociedades secretas, dinastias aristocráticas e super famílias ricas e seus cães complacentes que obedecem suas ordens para que eles possam comer as migalhas na sua mesa (Isso não inclui os Illuminati, como alguns tem alegado). \nEm sua arrogância e auto-engano, eles se vêem como deuses que merecem governar sobre nós eternamente, embora eles não são nada mais do que bastardos gananciosos e incompetentes. Mesmo em meio a uma crise global de crédito causada pela sua inépcia, estão enchendo os bolsos com o nosso dinheiro. \nEles só nos permitem desempenhar o papel do servo, enquanto eles querem ser os reis e rainhas. Com a ajuda de um efetivo e equipado sistema, eles nos impedem de gozar a vida e também fazem com que não tenhamos conhecimento da Matrix que estamos vivendo dentro da Velha Ordem Mundial, são as máquinas parasitas que vivem da nossa força de trabalho e dinheiro, enquanto nós pensamos que somos livres!",
				"added": 1460683722
			}
		],
		"1_1KDxmwZyfs7yomVvdubJgawnJfnoDv8uWs": [
			{
				"comment_id": 2,
				"body": "Oi",
				"added": 1460229975
			}
		],
		"1_14tezVvN6XQLxRg7kjvsDQ1A5DifgcHgtT": [
			{
				"comment_id": 3,
				"body": "ada",
				"added": 1460230053
			}
		],
		"3_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": [
			{
				"comment_id": 4,
				"body": "olá tem alguém ai ?",
				"added": 1460230095
			},
			{
				"comment_id": 14,
				"body": "http://opgd.weebly.com/lvcifer-o-portador-da-luz.html",
				"added": 1460236571
			}
		],
		"2_1EFMHNDwAJjBaDMUdTAJKmEVvehiJnkEss": [
			{
				"comment_id": 5,
				"body": "hi",
				"added": 1460230772
			},
			{
				"comment_id": 6,
				"body": "hi",
				"added": 1460230842
			},
			{
				"comment_id": 7,
				"body": "Ola",
				"added": 1460230854
			}
		],
		"4_16bxMyoL49mWYhcZKBYVBT5zEFW9SQpiao": [
			{
				"comment_id": 15,
				"body": "http://opgd.weebly.com/lvcifer-o-portador-da-luz.html",
				"added": 1460236582
			}
		],
		"1_1GUpiFeZrzjMZPwzAUWsVvF6vwiSZXeE2h": [
			{
				"comment_id": 16,
				"body": "Vamos encontrar vc",
				"added": 1460683115
			}
		]
	},
	"comment_vote": {
		"2_1KFcpas2mWGasKXdWCcwZrR1Fj8egfmd1Y": 1,
		"8_1J9VPbgaKxBjPKQ9nJhjNWgfb8qfhYRgMv": 1,
		"1_1F67VDXJVURec6cHk9rsfRhDBRKZfZnQNC": 1
	}
}