{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Buscando gente para charlar y crear contenidos (podcasts, webs, arte, expresionismo)",
			"body": "http://127.0.0.1:43110/165eqHdoQfyf7CVGqtVCGNDvMBZhwVSJBL/?Topic:1_1FDJNGTu75RPazzaf7h7qe317H9bhho2hN/Buscando+gente+para+charlar+y+crear+contenidos+podcasts+webs+arte+expresionismo",
			"added": 1465908557
		},
		{
			"topic_id": 2,
			"title": "TOC, TOC! -golpean la puerta- Hola, tiene un minuto para hablar de Game of Thrones?",
			"body": "Que le parece si divagamos sobre todo este simpático mundo?",
			"added": 1465911032
		}
	],
	"topic_vote": {},
	"next_comment_id": 12,
	"comment": {
		"2_193GRQHrQgpudYtUXtPkUp7z6DdYWkLfJX": [
			{
				"comment_id": 1,
				"body": "uno mas por aqui... investigando que se puede hacer en zero net...",
				"added": 1465903135
			},
			{
				"comment_id": 2,
				"body": "> [retest](#comment_6_157MVeoKveeBWvUFjemXzb1f4TJyZfzVkT): Bueno linces, por ahora tiene mi blog (que por cierto, no tiene una mierda)... Pero les recomiendo que le hechen una hojeada de vez en cuando, ahí subire mas info de mi nuevo proyecto \"Freeload\" (una web como taringa, pero descentralizada), nadie nos la va hacer caer ;D\n> http://27.0.0.1:43110/1PSVSd4bMv9wUiSCZsN5rj8Dw4BKnZHf1q/\n> PD: Estoy trabajando todavía en esto, por si no saben, soy desarrollador back-end y esto es puro front-end, así que denme tiempo...  Lo podría hacer mas rápido si pudieran agregar, por ejemplo, ejecutar código python, o php que tengo mucho mas esperienza con ese lenguaje...\n\nempezaste para el ojete amigo... eso de lince no va! es una gilada de taringa!",
				"added": 1465903212
			},
			{
				"comment_id": 3,
				"body": "busco un salon de chat.. una comunidad... algo asi hay en zeronet? gente que tenga ideas y quiera hablar (sobre todo hablar, no escribir..)",
				"added": 1465903349
			},
			{
				"comment_id": 4,
				"body": "> [polinesso](#comment_2_1Gfb349Y8BjRBSwTW3srWRXSdcMSocYVsC): Más de 24 mil libros en formato ePub en español creados con estrictas pautas de calidad, sin publicidad y soportados por una vibrante comunidad. Todo se distribuye mediante magnetic links. \n> http://epublibre.org\n\nlinda web che! lastima que todo en epub (los programas no le ponen buenas fuentes o complican pasar de paginas..) y que en dos titulos me esta pasando que no tienen semillas.\n Igualmente vemos.",
				"added": 1465905713
			},
			{
				"comment_id": 9,
				"body": "> [polinesso](#comment_3_1Gfb349Y8BjRBSwTW3srWRXSdcMSocYVsC): Los epubs se leen mejor en los lectores de libros electrónicos. Algunos modelos permiten cambiar las fuentes.\n> Dale tiempo a la semilla :)\n \n Si, le di tiempo y aparecio la semilla! Por otra parte yo leo en el celu, se puede perfectamente -tengo un pocket de los mas chiquitos- y con MuPDF anda muy bien cualquier cosa... en Pc en cambio no es tan asi (malditos epubs! jeje). Saludos.",
				"added": 1465980554
			},
			{
				"comment_id": 10,
				"body": "Haciendo cosas raras para gente normal -dice un tema de divididos-...\n\nhttp://127.0.0.1:43110/165eqHdoQfyf7CVGqtVCGNDvMBZhwVSJBL/?Topic:1_1FDJNGTu75RPazzaf7h7qe317H9bhho2hN/Buscando+gente+para+charlar+y+crear+contenidos+podcasts+webs+arte+expresionismo",
				"added": 1465980674
			}
		],
		"3_157MVeoKveeBWvUFjemXzb1f4TJyZfzVkT": [
			{
				"comment_id": 5,
				"body": "Se busca gente para hacer cosas y charlar!\n\nhttp://127.0.0.1:43110/165eqHdoQfyf7CVGqtVCGNDvMBZhwVSJBL/?Topic:1_1FDJNGTu75RPazzaf7h7qe317H9bhho2hN/Buscando+gente+para+charlar+y+crear+contenidos+podcasts+webs+arte+expresionismo",
				"added": 1465908245
			}
		],
		"2_1FDJNGTu75RPazzaf7h7qe317H9bhho2hN": [
			{
				"comment_id": 6,
				"body": "Viva el populismo de la reina de los dragones!",
				"added": 1465912023
			}
		],
		"1_1ETWpVe2YtLiHR2fHXroSxHL931uiP9RoL": [
			{
				"comment_id": 7,
				"body": "stop",
				"added": 1465915858
			},
			{
				"comment_id": 8,
				"body": "one moment please! rewind ok?",
				"added": 1465956002
			},
			{
				"comment_id": 11,
				"body": "> [sirenyc](#comment_67_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ): http://127.0.0.1:43110/1PLAYgDQboKojowD3kwdb3CtWmWaokXvfp/\n\nUse a network based on p2p free to post torrents of movies that either from their content, elements or script, perform the clear function of naturalizing in us that what we want to deliver, it seems a huge contradiction.\n\nUsar una red libre basada en p2p para publicar torrents de peliculas que ya sea desde su contenido, elementos o guion, cumplen la clara funcion de naturalizar en nosotros aquello de lo que nos queremos librar, me parece un enorme contrasentido.",
				"added": 1466066550
			}
		]
	},
	"comment_vote": {}
}