{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Videorama",
			"body": "http://127.0.0.1:43110/18SZadPsFtTEefBK5CTvRSFiBXs9TvAGEG/\n\nVideorama is a Portal where anyone can open their own channel by cloning someone else and add it to the Master site.\n\n\nTechnology is Merger sites, like ZeroMe.\nSo even if the Master Channel goes \"the way of the dodo\", the Channels could be added to another Master site and the content is not lost. A Channel Operator (ChanOp) can freely add any videos and is in fulll control of his own channel(s).\n\n\n\nMaybe some form of moderation could be built into the Master site in the future.\nNote that this would not be censorship, just moderation, as anyone could clone also the Master site and create a new base for the same channels to join there too.\n\n\nSo some Master SysOp could thematically decide to only accept channels of a certain thematical content or exclude specific other content, while another could start his own Master Channel in case he feels different about moderating certain content.\n\n\nThe easiest to try it courself is cloning this test channel and then add content to the new created channel:\nhttp://127.0.0.1:43110//13LQt6z1xRnyPMNFQRj47ftajv78G1ryDj/\n\n\nAfter that simply make your channel public by adding your channel address here:\nhttp://127.0.0.1:43110//18SZadPsFtTEefBK5CTvRSFiBXs9TvAGEG/register.html\n\n\nPost any bugs or ideas for improvement here.",
			"added": 1474742649
		}
	],
	"topic_vote": {},
	"next_comment_id": 2,
	"comment": {
		"3_1C1gnFcVv9J9kUjF4odDMRYcEWVPJbbqFp": [
			{
				"comment_id": 1,
				"body": "nutomic:\nyou need to clone any channel site first, so you have your own channel where you can upload videos and then sign&publish the channel.\nVideorama is built in the way, that you cannot upload and save on someones elses channel, which would be a trust risk for someone to upload something inappropiate and therefore ruin the trustworthyness of an established channel.\nChannels are like Hubs btw. so they are part of the Videorama Main Merger site, where all published videos of all channels are shown.",
				"added": 1473880707
			}
		]
	},
	"comment_vote": {}
}