{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Bwoi - Google-like in-development search engine",
			"body": "http://127.0.0.1:43110/bwoi.bit",
			"added": 1457033946
		}
	],
	"topic_vote": {
		"1_19z3VucxwAoyQZwhmjEgA6vJ9TTp2GmGLN": 1
	},
	"next_comment_id": 9,
	"comment": {
		"1_19z3VucxwAoyQZwhmjEgA6vJ9TTp2GmGLN": [
			{
				"comment_id": 1,
				"body": "> [pycole](#comment_9_1KwTTgPRSTHFmmJAFBt6kQfdyNeSM5KJuH): Neat. if you want to access zerosearch's list of sites, you can find it in data/1ZeroeuDnL2jNS6t1epQa1SPvC91KG8ER/data.dat (not sure if you already did or not.) Only complaint so far: hitting enter doesn't trigger a search. Just a bit of an annoyance, that's all.\n\nThanks man! <3",
				"added": 1457110056
			},
			{
				"comment_id": 2,
				"body": "> [kilow](#comment_1_1Mwm45xgWJkwaqQeXcLKqPy4KcTNM8XcbD): No porn results, it's bad.\n\nThis has now been fixed!\n\n> [zaphod](#comment_2_1JA2umSc9f7VSNLaYLs1Cpk7rpvS4p18xe): Looks very good, have to second the \"search on enter\", though.\n\nI've now fixed that too! :)",
				"added": 1457116280
			},
			{
				"comment_id": 3,
				"body": "> [zaphod](#comment_4_1JA2umSc9f7VSNLaYLs1Cpk7rpvS4p18xe): Great!Starting to like Bwoi more and more :) \n> Any insider info on how you got to that name?\n\nThanks!\n\"LetsRaceBwoi\" is my username on multiple websites (Twitch, Twitter, some forums) and therefore I took \"Bwoi\" from the name and decided to use it as a name for a search engine.\n\n> [bateller](#comment_1_1A7ebtQG9zaZBFSUcTMp5DYpVwBoDFrCAJ): Very cool. How to add sites?\n\nI'm working on it! Currently we have the largest index anyway, so I should work on compressing it somewhat too.",
				"added": 1457164488
			},
			{
				"comment_id": 4,
				"body": "> [zaphod](#comment_7_1JA2umSc9f7VSNLaYLs1Cpk7rpvS4p18xe): Interesting! Nonetheless, I was using Bwoi a bit and seemed to be getting some duplicate results, torrent.zerolimits is one example - so the index should probably be cleared, as that might be distracting/annoying to some users. Otherwise, good job and keep it up!\n\nI'll look through the index today, in hopes of finding all the duplicates and removing them - thanks for telling me! :)",
				"added": 1457165230
			},
			{
				"comment_id": 5,
				"body": "> [kaffie](#comment_10_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): If you need a tool to detect duplicates, I've provided one here. It only checks the address, rather than domain names. But I tried it on the names.json at the root of your site and it picked up quite a few. Might help you clean out the list.\n\nThanks man! :)",
				"added": 1457165557
			},
			{
				"comment_id": 6,
				"body": "> [kaffie](#comment_10_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): If you need a tool to detect duplicates, I've provided one here. It only checks the address, rather than domain names. But I tried it on the names.json at the root of your site and it picked up quite a few. Might help you clean out the list.\n\nI don't think your tool's working properly.  It's listing bwoi.bit as being a duplicate when I've made sure that it's only there once?",
				"added": 1457169338
			},
			{
				"comment_id": 7,
				"body": "> [kaffie](#comment_11_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): It doesn't really work properly with .bit domains, so it might be struggling there. For reference, I ran it on the names.json file at the root of bwoi.bit and it gave me: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_2\n> I don't see the bwoi address 1f7FYxZWSZ5YG7Nd8sGsHcWEQgvdnVvQF in there at all. Could you paste the output in a NullPaste so I can see what it's doing? It should work properly. All it's doing is grabbing the list of addresses using regex, and then turning it into a set to remove duplicates (built in python function) and then comparing the two lists. If there's a duplicate listed, it's almost certainly a duplicate.\n\nAh, nevermind, I made a code change and stopped it from working, sorry.  I've also fixed duplicates in results, but the indexing number is still inaccurate because I haven't changed names.json.",
				"added": 1457170469
			},
			{
				"comment_id": 8,
				"body": "> [kaffie](#comment_12_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Just an FYI, you have two duplicate sites now. Not one :P. I've updated the 'why' page to detail it a bit more. Just trying to keep everyone honest. Bwoi's neat. And it definitely has potential. I just hate to see it spoiled on petty one-ups of faulty numbers.\n> But at least you're making an effort, rather than like ZeroSearch, which still has many duplicate sites, has not correctly reported site count, has copied features of Kaffiene, etc.\n> I'm providing the tools and information to make ZeroNet search the best it can be. Please don't take that the wrong way. I have no control over bwoi, and it's best to inform users what's up. To see an index have '308' sites when it really has ~260 is misleading. Bwoi has 280 sites. Not 300. Not 282. Not 281.\n\nJust saying, I copied ZeroSearch's indexes and then added some sites from yours to make sure I was 'up to date'.  It's fine if you don't want me using stuff from your site so I've taken the liberty to use an old backup.  I've also now updated my names.json and have no duplicates as far as I know.  I think that the one exception your tool didn't find was actually from ZeroSearch, so I've also removed it there too.  I don't want to be against you at all, and I know you're trying to help.  I'm also rounding my numbers now, to make things a little nicer. I've also added a little link to Kaffiene in case it has results that Bwoi doesn't.",
				"added": 1457181575
			}
		]
	},
	"comment_vote": {
		"9_1KwTTgPRSTHFmmJAFBt6kQfdyNeSM5KJuH": 1,
		"2_1FfLoFiiFnaf2RPE4nqHEP8mB9uU2rPTmH": 1,
		"10_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"8_1JA2umSc9f7VSNLaYLs1Cpk7rpvS4p18xe": 1,
		"7_1JA2umSc9f7VSNLaYLs1Cpk7rpvS4p18xe": 1,
		"11_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"12_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1
	}
}