{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "El sitio web descentralizado del magic esta disponible, no se desesperen... Hay un poco de Magic para todos.",
			"body": "http://127.0.0.1:43110/1PSVSd4bMv9wUiSCZsN5rj8Dw4BKnZHf1q/",
			"added": 1465327177
		},
		{
			"topic_id": 2,
			"title": "<b>shit</b>",
			"body": "dsa",
			"added": 1465327214
		},
		{
			"topic_id": 3,
			"title": "Chat Argetina! - Un chat donde se permite todo",
			"body": "No es un chat como los de zeronet, tiene un nuevo diseño (que va a cambiar de vez en cuando), mucho mejor que los demas y esta traducido a español.\nhttp://127.0.0.1:43110/12RXQQaKKNvRKnZVizJKy78XiPcBEYtpv2/",
			"added": 1465493450
		}
	],
	"topic_vote": {
		"3_157MVeoKveeBWvUFjemXzb1f4TJyZfzVkT": 1
	},
	"next_comment_id": 7,
	"comment": {
		"2_193GRQHrQgpudYtUXtPkUp7z6DdYWkLfJX": [
			{
				"comment_id": 1,
				"body": "Pff, ya hay ratas y todo en esta hermosa plataforma...",
				"added": 1465323988
			},
			{
				"comment_id": 6,
				"body": "Bueno linces, por ahora tiene mi blog (que por cierto, no tiene una mierda)... Pero les recomiendo que le hechen una hojeada de vez en cuando, ahí subire mas info de mi nuevo proyecto \"Freeload\" (una web como taringa, pero descentralizada), nadie nos la va hacer caer ;D\n \nhttp://27.0.0.1:43110/1PSVSd4bMv9wUiSCZsN5rj8Dw4BKnZHf1q/\n\nPD: Estoy trabajando todavía en esto, por si no saben, soy desarrollador back-end y esto es puro front-end, así que denme tiempo...  Lo podría hacer mas rápido si pudieran agregar, por ejemplo, ejecutar código python, o php que tengo mucho mas esperienza con ese lenguaje...",
				"added": 1465433678
			}
		],
		"1_157MVeoKveeBWvUFjemXzb1f4TJyZfzVkT": [
			{
				"comment_id": 2,
				"body": "A ver linduras, solo tienen que entrar al link...",
				"added": 1465327457
			},
			{
				"comment_id": 3,
				"body": "dsf",
				"added": 1465418948
			},
			{
				"comment_id": 4,
				"body": "das",
				"added": 1465418970
			}
		],
		"1_1CMjV2r4EBpFt8VCcWWZKDysZXPcPExRNN": [
			{
				"comment_id": 5,
				"body": "It is only a html template, do not get to do a proof of concept because there is nothing there to connect with zeronet api ...\n\nIt's just a demo of a template, nothing more, no \"proof of concept\".",
				"added": 1465433187
			}
		]
	},
	"comment_vote": {}
}