{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Bwoi Games",
			"body": "127.0.0.1:43110/13mnodV6UoMt94JdmQXvNaBFyt9mnrQGGx",
			"added": 1458919323
		},
		{
			"topic_id": 2,
			"title": "Bwoi 2.1 (revamped version of Bwoi)",
			"body": "http://127.0.0.1:43110/bwoi.bit/\nI've been working on fixing Bwoi and making it work a lot better, but some browsers (i.e. Firefox) don't support some features.  I recommend using Chrome, since that's where it's been tried and tested and the UI looks much better, but other browsers should still maintain at least some functionality.  I'm also working on another side project named \"BwoiTweet\", so stay tuned for that one!  Indexes should be updated tonight when I push the auto-updater to my VPS :)",
			"added": 1470312134
		}
	],
	"topic_vote": {
		"1_1LhE99w81SoJgXQyXHAUSbAYpq8XqmoMw4": 1,
		"1_19z3VucxwAoyQZwhmjEgA6vJ9TTp2GmGLN": 1,
		"1_1MA9FAQkvuKGyyr29ecGJ3FtMjPKBtJhpU": 1,
		"2_1F1kDrT693w8ATbcXV1wHmGSD6SpSY4f5L": 1
	},
	"next_comment_id": 13,
	"comment": {
		"1_19z3VucxwAoyQZwhmjEgA6vJ9TTp2GmGLN": [
			{
				"comment_id": 1,
				"body": "> [kaffie](#comment_14_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): The issue isn't copying my index of sites. You can freely take that. The issue is misleading results due to duplicate and 'bad' entries. Hopefully this all didn't come across in the wrong way. Bwoi was mostly just caught in the crossfire. The main reason I put up the 'why' page was ZeroSearch. Bwoi appeared to have copied the results as well, but I see now it's mostly because you copied ZeroSearch who copied Kaffiene.\n> When I first ran across Bwoi, I was a bit skeptical, since it boasted a huge number of sites. It seems that it was mostly a merging issue, and that's been taken care of. There was still some issues with duplicate entries, so I pointed those out. And the resulting list more or less resulted in ZeroSearch's list combined with a few new entries of mine, which then resulted in more or less my list. Amusingly this is due to me having a lot (~130) of ZeroSearch's entries due to cloning, and then ZeroSearch taking Kaffiene's index in a rush and not caring to fix issues. I have no doubt that it's mostly due to the sloppy work of ZeroSearch at this point. But Bwoi did mirror Kaffiene's results (even now there's many links that are word-for-word the same entries as Kaffiene), and did have duplicate results.\n> I'm fine with the other sites sharing the index. I just find it dishonest to try and then use that, along with duplicate entries to try and boast the largest site count. The 'why' page was originally meant to clarify this, and explain that it's not the fault of Kaffiene for lacking, but for the other sites having duplicates.\n> And so, for the time being, I've cleared Bwoi from the page besides an update that clarifies this, and am leaving it up until ZeroSearch removes it's duplicate entries or Kaffiene surpasses ZeroSearch in site count (despite ZS's duplicates). If you'd like me to remove any mention of Bwoi, that's fine too.\n\n(I'm Bwoi now!)\nI don't think anything really did come across in a bad way as I can totally understand you protecting your site and trying to make it better - and I respect that.  I'll try and see if there are any more duplications and try and \"differentiate\" my site from yours - there's not really much point in reinventing the wheel.  ZeroSearch is pretty much dead at this point - probably due to the fact that it's just a clone of Kaffiene.",
				"added": 1457184126
			},
			{
				"comment_id": 2,
				"body": "> [kaffie](#comment_15_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Yea, it was mostly just frustration. It's frustrating when you see a site has 'more' sites listed due to duplicates, so you go through and get 60+ more links and they're just copied the next day. Unwinnable. There'd always be those 25 extra links, and they'd always copy the new ones. It's easier to address the issue than to partake in a race I'd surely lose.\n> As for Bwoi, I really like the UI. I've said that before, and it's still true. It's very google-esque, and I could see you doing great things with it. The initial pull you had with just .bit domains was interesting, since it provided something unique. Now there's not much to it besides a nicer UI (Kaffiene's sucks, lol). But I'm interested to see where you'll take it.\n\nI totally understand why you'd be frustrated, and I've had the same feeling with other things too.  The UI on mine doesn't look right on Mac systems since Segoe UI isn't installed as a font there, and OSX defaults to using the San Francisco font (as far as I know) so I should probably choose a different font.  Kaffiene's UI isn't as bad as some other websites out there, in fact it's probably better than 80% of other ZeroNet sites from a first glance.  I'm going to be introducing other services (video, chat) to Bwoi soon, as well, as soon as I finish coding them :)",
				"added": 1457186749
			},
			{
				"comment_id": 3,
				"body": "> [zaphod](#comment_10_1JA2umSc9f7VSNLaYLs1Cpk7rpvS4p18xe): Woohoo, interesting things coming up! Nice to know that Bwoi will make a move into it's own direction. Good features! How very google-like of you ;)\n\nHaha, thanks.  Maybe in a few years time we'll have our own phone range and mobile operating system ;)",
				"added": 1457196246
			},
			{
				"comment_id": 4,
				"body": "BwoiVideo now has a release date: 12th March 2016, 4PM GMT :)",
				"added": 1457271648
			},
			{
				"comment_id": 5,
				"body": "> [basxto](#comment_14_1PVcdu7USZH2kHMETbqDYLPjJZKCDWM52k): I dunno, I reckon that phones are dying … tox and ring are coming.\n> Just fork an existing OS and make your own anbwoid ;)\n\nIt was a joke, but I might actually create some sort of Android ROM that works with ZeroNet ;)",
				"added": 1457871928
			},
			{
				"comment_id": 6,
				"body": "> [eneide](#comment_1_1FiCP9bjwuo9rWFmfTwiwMMjVcUdqGefB4): good work\n\nThanks! <3",
				"added": 1458593866
			},
			{
				"comment_id": 7,
				"body": "> [thisguy1337](#comment_24_16bxMyoL49mWYhcZKBYVBT5zEFW9SQpiao): I know kaffie doesn't like the search indexes being copied, but it would be nice to have Bwoi more populated with links. Feelings of copying be damned.\n> Right now is the time for development, and having someone copy your code should make someone feel good. (you're doing something right and inspiring) Especially when it comes to providing an abundance of content for the masses, which is the most important part of it all.\n> All we can do is critique the sites in their own way. Categories, ranking, keywords, description, can even implement a star \"ranking\" system.\n> It's not about how many sites we have indexed, it's about what we do with it and how it's provided to the visitors.I really like Bwoi's UI but I <3 Kaffie's search index. Competition is good, it promotes creativity. ZeroSearch is just an eye sore (imo).\n> I say thank goodness for Kaffiene search, Bwoi and the link.\n\nI could add an option to use different indexes if that's what people want, for instance a dropdown box with \"Bwoi\", \"Kaffiene\" and \"ZeroSearch\" selections which will change the index URL.  That way I'd probably get more accurate results; either that, or a merger between Bwoi and Kaffiene happens (I'm open for that) and the UI, management and indexes all get shared and mixed into one centralized site.",
				"added": 1458765661
			},
			{
				"comment_id": 8,
				"body": "> [thisguy1337](#comment_25_16bxMyoL49mWYhcZKBYVBT5zEFW9SQpiao): That would be really really cool and bring back loads of functionality.\n\nI'll work on it.  Since Kaffiene and Bwoi use completely different indexing methods (Bwoi uses JSON, Kaffiene uses a proprietary method?) I'll have to convert those in Javascript on-the-fly.  Changes should be pushed either later today or tomorrow.",
				"added": 1458766557
			},
			{
				"comment_id": 9,
				"body": "> [thisguy1337](#comment_26_16bxMyoL49mWYhcZKBYVBT5zEFW9SQpiao): This is only the beginning, just wait until someone pushes out the first zite crawler and places it into a local database that gets updated 24 hrs or so.\n\nIt'd be pretty difficult, but possible.",
				"added": 1458767481
			},
			{
				"comment_id": 10,
				"body": "Alright, I've added a \"Kaffiene Search\" option and brought the index count to 1010+ with only 4 duplicates, I might merge the indexes in the future but for now I'm fine with this.  Suggestions are welcome.",
				"added": 1458767871
			}
		],
		"2_1F1kDrT693w8ATbcXV1wHmGSD6SpSY4f5L": [
			{
				"comment_id": 11,
				"body": "> [kaffie](#comment_23_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): I didn't notice any differences between Firefox and Chrome, besides that firefox seemed to glitch when the UI shifts and messes up the input a bit. Either way, I'm liking the UI. Reminds me a lot of bing.\n\nI was actually aiming for a Bing/Metro feel, with the simplistic effect (hence why I'm using the same fonts) mixed in with the Google layout (Bing's search bar positioning isn't to my liking, unfortunately), so it's glad that it's come through how I wanted it :)\n\nFirefox doesn't blur the background due to lack of support for the blur filter.  It can be done with different methods, but since I don't use Firefox for ZeroNet, it isn't very high priority.  I also can't work out why Firefox is doing that, because the code order states that the value is copied across before the other search box is focused... I'll have to look in to it -- maybe Firefox simply doesn't focus textboxes in the same way as Chrome?\n> I'm curious what you mean by 'auto-updater'... Are you actually crawling sites for tags/info? Simply grabbing new sites from the various lists/dbs and uploading without tags? Keep up the good work. I came back to ZeroNet after a 3 month hiatus and found all of the other search engines were dead >_<. Glad to see Bwoi is still on-going.\n\nBwoi has been dead since around April when my PC crashed/broke, but I managed to scavenge my private key which allowed me to fix numerous bugs and introduce a couple of UI features.  Indexing is currently done using a modified version of your script, but there are no tags as of yet (hence why some of the newer sites have the \"need_tags\" tag).  This should be fixed using a simple auto-tagger which I'm working on (i.e. if the site has the word \"blog\" in the title, assign it the \"blog\" tag) which will be rolled out with the auto-updater eventually.  All the auto-updater does is run the script at timed intervals (currently 24h), and doesn't do anything too fancy - yet.  At least this time I won't have to copy your index :)\n\nI'm also working on adding various improvements to Bwoi, such as speeding up the script and changing the background every day, a bit like Bing's \"photo of the day\".\n\nGood to see that you're back by the way :)\n",
				"added": 1470328448
			},
			{
				"comment_id": 12,
				"body": "> [ifreedom](#comment_5_1rZ7QjeErYTdNKKvTSonssHtzFttMQpsi): another search engine like kaffie :) keep improving\n\nI see Kaffiene not as inferior, but as something that I should work alongside, and with good reason: Kaffiene and Bwoi are very different.  Bwoi actually came first (back in February) but wasn't really known amongst the community, and then Kaffiene came along and offered nothing more and looked a lot like ZeroSearch ;) Now, it offers many more features, such as regex searching and peer counts, which I probably won't delve too deep into - I wish to keep Bwoi as simple as possible for speed's sake and for beginner purposes.  I may introduce Google-like custom searching in the future, but that will be as ZeroNet develops.",
				"added": 1470690080
			}
		]
	},
	"comment_vote": {
		"14_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"10_1JA2umSc9f7VSNLaYLs1Cpk7rpvS4p18xe": 1,
		"14_1PVcdu7USZH2kHMETbqDYLPjJZKCDWM52k": 1,
		"1_1FiCP9bjwuo9rWFmfTwiwMMjVcUdqGefB4": 1,
		"24_16bxMyoL49mWYhcZKBYVBT5zEFW9SQpiao": 1,
		"12_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx": 1,
		"1_17VwZEfWSUWb5RHkK9m1odnDdBfvjTL6Cp": 1,
		"6_1rZ7QjeErYTdNKKvTSonssHtzFttMQpsi": 1
	}
}